csv - comma-separated values - данные разделенные запятой
- df = pd.read_csv('file.csv', # функция считывания внешнего файла формата csv (можно выбрать необходимый формат)
                 encoding='windows-1251',
                 sep = ';',
                 index_col='название_столбца',
                 parse_dates=['Date'],
                 dayfirst=True)
'file.csv' - путь к файлу,

sep - разделитель sep(по умолчаниию ',')
encoding – параметр в read_csv, отвечает за кодировку текста, которая может быть различной. Самая распространённая – utfindex_col='название_столбца' - название столбца, который будет выступать как столбец индексов
index_col=[0] - индекс столбца, который будет выступать как столбец индексов
parse_dates – указывает, стоит ли воспринимать даты как даты (по умолчанию они воспринимаются пандасом как строки).
    пример pd.read_csv(path, parse_dates=['some_date', 'another_date'])
    Параметр с датами может принимать несколько значений:
    True – пытается перевести в дату первую колонку
    список колонок – parse_dates=['some_date', 'another_date']
    пытается перевести в дату указанные в списке колонки и столбцы create_data, payment_data
    будут обрабатываться как даты

dayfirst=True  - первое значение в дате это день или нет - True/False
df['Date'].dt.name - номер дня недели в соответствии с данными в колонке с датами
df['Date'].dt.name() - название дня недели в соответствии с данными в колонке с датами
df['Date'].dt.month - номер месяца в соответствии с данными в колонке с датами
df['Date'].dt.month() - название месяца в соответствии с данными в колонке с датами