import pandas as pd
import random
import datetime
import os

def new_base(size: int = 200) -> pd.DataFrame :
    syllables = ['ба', 'бо', 'бу', 'бы', 'би', 'бя', 'бю', 'бе', 'ва', 'во', 'ву', 'вы', 'вэ', 'ви', 'вя', 'вю', 'ве', 'да', 'до', 'ду', 'ды', 'ди', 'дя', 'дю', 'де', 'га', 'го', 'гу', 'ги', 'гя', 'гю', 'ге', 'за', 'зо', 'зу', 'зи', 'зя', 'зю', 'зе', 'ка', 'ко', 'ку', 'ки', 'кя', 'кю', 'ке', 'са', 'со', 'су', 'сы', 'си', 'ся', 'сю', 'се', 'па', 'по', 'пу', 'пы', 'пи', 'пя', 'пю', 'пе', 'жа', 'жо', 'жу', 'жи', 'жю', 'же', 'ла', 'ло', 'лу', 'лы', 'ли', 'ля', 'лю', 'ле', 'ма', 'мо', 'му', 'мы', 'ми', 'мя', 'мю', 'ме', 'на', 'но', 'ну', 'ны', 'ни', 'ня', 'ню', 'не', 'ра', 'ро', 'ру', 'ри', 'ря', 'рю', 'ре', 'та', 'то', 'ту', 'ти', 'тя', 'тю', 'те', 'ха', 'хо', 'ху', 'хи', 'хя', 'хю', 'хе', 'ца', 'цо', 'цу', 'ци', 'це', 'ша', 'шо', 'шу', 'ши', 'ше', 'ща', 'що', 'щу', 'щи', 'ще', 'ча', 'чо', 'чу', 'чи', 'че', 'фа', 'фо', 'фу', 'фи', 'фя', 'фе', 'аб', 'об', 'уб', 'иб', 'яб', 'юб', 'ав', 'ов', 'ув', 'ив', 'яв', 'юв', 'ев', 'ад', 'од', 'уд', 'ид', 'яд', 'юд', 'ед', 'аг', 'ог', 'уг', 'иг', 'яг', 'юг', 'ег', 'аз', 'оз', 'уз', 'из', 'яз', 'юз', 'ез', 'ак', 'ок', 'ук', 'ик', 'як', 'юк', 'ек', 'ас', 'ос', 'ус', 'ис', 'яс', 'юс', 'ес', 'ап', 'оп', 'уп', 'ип', 'яп', 'юп', 'аж', 'ож', 'уж', 'иж', 'юж', 'еж', 'ал', 'ол', 'ул', 'ил', 'ял', 'юл', 'ел', 'ам', 'ом', 'ум', 'им', 'ям', 'юм', 'ем', 'ан', 'он', 'ун', 'ин', 'ян', 'юн', 'ен', 'ар', 'ор', 'ур', 'ир', 'яр', 'юр', 'ер', 'ат', 'от', 'ут', 'ит', 'ят', 'ют', 'ет', 'ах', 'ох', 'ух', 'их', 'ях', 'юх', 'ех', 'ац', 'оц', 'уц', 'иц', 'яц', 'юц', 'ец', 'аш', 'ош', 'уш', 'иш', 'яш', 'юш', 'еш', 'ач', 'оч', 'уч', 'ич', 'яч', 'юч', 'еч', 'аф', 'оф', 'уф', 'иф', 'яф', 'юф', 'еф']
    endings = ['лин', 'лов', 'нин', 'нов', 'шин', 'шов', 'рин', 'ров', 'пин', 'пов', 'ков', 'кин', 'ко', 'кий', 'ций', 'вич', 'цев', 'цов', 'цин']
    names = ['Андрей', 'Борис', 'Владимир', 'Георгий', 'Дмитрий', 'Евгений', 'Иосиф', 'Кирилл', 'Леонид', 'Михаил', 'Николай', 'Олег', 'Петр', 'Роман', 'Сергей', 'Тимофей', 'Умар', 'Фёдор', 'Харитон', 'Эмануил', 'Юрий', 'Яков']
    middles = ['Андреевич', 'Борисович', 'Владимирович', 'Георгиевич', 'Дмитриевич', 'Евгеньевич', 'Иосифович', 'Кириллович', 'Леонидович', 'Михаилович', 'Николаевич', 'Олегович', 'Петрович', 'Романович', 'Сергеевич', 'Тимофеевич', 'Умарович', 'Фёдорович', 'Харитонович', 'Эмануилович', 'Юрьевич', 'Яковлевич']
    mobile_prefix = ['910', '915', '916', '917', '919', '985', '986', '903', '905', '906', '909', '962', '963', '964', '965', '966', '967', '968', '969', '980', '983', '986', '925', '926', '929', '936', '999', '901', '958', '977', '999', '995', '996', '999']
    phone_prefix = ['495', '499', '498']

    soc_id = list()
    last_name = list()
    first_name = list()
    middle_name = list()
    birth_day = list()
    mobile = list()
    phone = list()

    for i in range(int(size)):
        soc_id.append(i)
        last_name.append(''.join(random.sample(syllables, random.randint(2, 3)) + random.sample(endings, 1)).title())
        first_name.append("".join(random.sample(names, 1)))
        middle_name.append("".join(random.sample(middles, 1)))
        birth_day.append( datetime.date.fromtimestamp(random.randint(0, 1000000000)).strftime("%Y-%m-%d"))
        mobile.append('8' + ''.join(random.sample(mobile_prefix, 1)) + str(random.randint(1111111, 9999999)))
        phone.append('8' + ''.join(random.sample(phone_prefix, 1)) + str(random.randint(1111111, 9999999)))
    
    base = pd.DataFrame({ 'id': soc_id,
                        'last': last_name,
                        'first': first_name,
                        'middle': middle_name,
                        'birth': birth_day,
                        'cell': mobile,
                        'tel': phone
                        })
    base.set_index("id")
    return base

def save_base(base: pd.DataFrame, name: str = "base.csv") -> str:
    return base.to_csv(name, index=False)

def del_file(filename: str) -> str:
    return os.remove(filename)

db = new_base(100)
db.info()
